In [4]:
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd
import numpy as np
import datetime

In [5]:
# Files to Load 
cityDataCSV = "data/city_data.csv"
rideDataCSV = "data/ride_data.csv"

In [6]:
# Read the City and Ride Data
dfCity = pd.read_csv(cityDataCSV)
dfRide = pd.read_csv(rideDataCSV)

In [7]:
dfCity.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [8]:
dfRide.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2018-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2018-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2018-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2018-02-10 23:22:03  23.44  5149245426178
4          South Jack  2018-03-06 04:28:35  34.58  3908451377344

In [9]:
dfCity.count()

city            120
driver_count    120
type            120
dtype: int64

In [10]:
dfRide.count()

city       2375
date       2375
fare       2375
ride_id    2375
dtype: int64

In [11]:
# Merge two dataframes using a full join
#Should only need a left merge.  Chose full in the event there was a city with no driver data.
dfMerge = pd.merge(dfRide, dfCity, how="outer", on="city")
dfMerge.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2018-01-14 10:14:22,13.83,5739410935873,5,Urban
1,Lake Jonathanshire,2018-04-07 20:51:11,31.25,4441251834598,5,Urban
2,Lake Jonathanshire,2018-03-09 23:45:55,19.89,2389495660448,5,Urban
3,Lake Jonathanshire,2018-04-07 18:09:21,24.28,7796805191168,5,Urban
4,Lake Jonathanshire,2018-01-02 14:14:50,13.89,424254840012,5,Urban

In [12]:
dfMerge.count()
#confirm the total count is 2375.  If greater, there was a city without a record in the driver table.

city            2375
date            2375
fare            2375
ride_id         2375
driver_count    2375
type            2375
dtype: int64

In [13]:
dfMerge.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2018-01-14 10:14:22,13.83,5739410935873,5,Urban
1,Lake Jonathanshire,2018-04-07 20:51:11,31.25,4441251834598,5,Urban
2,Lake Jonathanshire,2018-03-09 23:45:55,19.89,2389495660448,5,Urban
3,Lake Jonathanshire,2018-04-07 18:09:21,24.28,7796805191168,5,Urban
4,Lake Jonathanshire,2018-01-02 14:14:50,13.89,424254840012,5,Urban

In [14]:
#Come back to this.   
#date = datetime.datetime.strptime(dfMerge["date"], "%d %b %Y  %H:%M:%S.%f")

In [15]:
#dfMerge["dateOnly"] = datetime.datetime.strptime(dfMerge["date"], "%Y %b %d")

#### Part A - Create a dataframe with the data needed.
* Step 1, Create a dataframe with the city, average fare, and total number of rides.
* Step 2, Perfrom a merge to get the city type

In [18]:
dfRide.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2018-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2018-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2018-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2018-02-10 23:22:03  23.44  5149245426178
4          South Jack  2018-03-06 04:28:35  34.58  3908451377344

In [29]:
#Number of Rides By City.
RidesByCity = dfRide["city"].value_counts()
print(RidesByCity)

West Angela             39
South Karenland         38
North Jason             35
Liumouth                33
Port Frank              33
South Phillip           31
South Evanton           31
South Michelleport      31
West Robert             31
West Anthony            30
North Jasmine           30
New Kimberlyborough     30
Royland                 30
Justinberg              30
East Kaylahaven         29
Loganberg               28
Karenside               28
Hurleymouth             28
Richardfort             28
West Heidi              28
Carriemouth             27
Christopherfurt         27
East Marymouth          27
Josephside              27
West Christopherberg    26
West Josephberg         26
Lake Danielberg         26
Lake Robertside         25
Jerryton                25
West Samuelburgh        25
                        ..
Lake Omar               14
North Richardhaven      14
North Markport          14
Victoriaport            14
Williamsonville         14
North Jeffrey           13
East Kentstad           13
Lewishaven              12
Lake Ann                12
Erikaland               12
Michaelberg             12
Sotoville               11
Lake Latoyabury         11
Bradshawfurt            10
West Heather             9
East Aaronbury           9
North Holly              9
South Marychester        8
North Jaime              8
South Jennifer           7
Lake Jamie               6
New Ryantown             6
Harringtonfort           6
Jessicaport              6
Taylorhaven              6
Randallchester           5
Penaborough              5
South Saramouth          4
Newtonview               4
Garzaport                3
Name: city, Length: 120, dtype: int64

In [21]:
dfRideSummary = dfRide.groupby(["city"]).agg({ "fare":'mean',"ride_id":'count'})

In [38]:
#Confirm the counts in my dataframe (dfRideSummary)are the same as the original data (RidesByCity)
#This is an "eyeball" check.   Change to both ascending and descending to compare.
dfRideSummary.sort_values(["ride_id"], ascending=False).head(5)

                      fare  ride_id
city
West Angela      25.990000       39
South Karenland  26.535526       38
North Jason      22.743714       35
Liumouth         26.150000       33
Port Frank       27.201515       33

In [45]:
#stepA1 is complete
dfRideSummary.head()

                    fare  ride_id
city
Amandaburgh    24.641667       18
Barajasview    25.332273       22
Barronchester  36.422500       16
Bethanyland    32.956111       18
Bradshawfurt   40.064000       10

In [46]:
#Step A2, Perfrom a merge to get the city type
#this will also bring the unnecessary driver_count column which serves no purpose, but also causes no harm.
dfRideSummaryMerged = pd.merge(dfRideSummary, dfCity, how="left", on=["city", "city"])
dfRideSummaryMerged.head()

            city       fare  ride_id  driver_count      type
0    Amandaburgh  24.641667       18            12     Urban
1    Barajasview  25.332273       22            26     Urban
2  Barronchester  36.422500       16            11  Suburban
3    Bethanyland  32.956111       18            22  Suburban
4   Bradshawfurt  40.064000       10             7     Rural

In [42]:
#Change the labels so they are logical
dfRideSummaryMerged = dfRideSummaryMerged.rename(columns={"fare": "avgFare", 
                                              "ride_id": "totalRides",
                                              "driver_count": "driverCount"
                                             })
dfRideSummaryMerged.head(20)

               city    avgFare  totalRides  driverCount      type
0       Amandaburgh  24.641667          18           12     Urban
1       Barajasview  25.332273          22           26     Urban
2     Barronchester  36.422500          16           11  Suburban
3       Bethanyland  32.956111          18           22  Suburban
4      Bradshawfurt  40.064000          10            7     Rural
5       Brandonfort  35.437368          19           10  Suburban
6       Carriemouth  28.314444          27           52     Urban
7   Christopherfurt  24.501852          27           41     Urban
8       Colemanland  30.894545          22           23  Suburban
9         Davidfurt  31.995882          17           23  Suburban
10        Deanville  25.842632          19           49     Urban
11   East Aaronbury  25.661111           9            7  Suburban
12  East Danielview  31.560588          17           22  Suburban
13  East Kaylahaven  23.757931          29           65     Urban
14    East Kentstad  29.823077          13           20  Suburban
15   East Marymouth  30.835185          27            5  Suburban
16        Erikaland  24.906667          12           37     Urban
17        Garzaport  24.123333           3            7     Rural
18      Grahamburgh  25.221200          25           61     Urban
19        Grayville  27.763333          15            2  Suburban

In [43]:
#determine if the datatypes can be used for graphing.  ie, numeric
dfRideSummaryMerged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 120 entries, 0 to 119
Data columns (total 5 columns):
city           120 non-null object
avgFare        120 non-null float64
totalRides     120 non-null int64
driverCount    120 non-null int64
type           120 non-null object
dtypes: float64(1), int64(2), object(2)
memory usage: 5.6+ KB